cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'node'
brew 'zsh'
brew 'findutils'
brew 'openssl'
brew 'nvm'
brew 'httpie'
brew 'git'
brew 'go'

cask 'alfred'
cask 'iterm2'
cask 'skype'
cask 'spectacle'
cask 'visual-studio-code'
cask 'macvim'
cask 'google-chrome'
cask 'slack'
cask 'vlc'
cask 'caffeine'
cask 'sqlectron'
cask 'spotify'
cask 'postman'
